<?
/**
 * 定义应用所需常量
 */
$define = array(
	//来源渠道
    'SOURCE' => array(
        '1'  => '管家',
        '2'  => '顾问',
		'4'  => '展示页',
		'5'  => '引导页',
		'6'  => '400',
		'7'  => '乐语',
		'8'  => '百度商桥',
		'3'  => '其他',
		'9'  => '同行',
		'10'  => '一只蝉',
    ),
	//出售商标状态
    'SALE_STATUS' => array(
        '1'  => '销售中',
		'2'  => '已下架',
        '3'  => '待审核',
    ),
	
	//商标类型
    'TYPES' => array(
		'1'  => '中文',
        '2'  => '英文',
        '3'  => '图形',
		'4'  => '中+英',
		'5'  => '中+图',
		'6'  => '英+图',
		'7'  => '中+英+图',
		'8'  => '数字',
    ),

    'OP_TYPE' => array(
    	'1' 	=> '商品上架',
    	'2' 	=> '商品下架',
    	'3' 	=> '创建商品',
    	'4' 	=> '编辑商品',
    	'5' 	=> '审核联系人',
    	'6' 	=> '加入黑名单',
    	'7' 	=> '删除黑名单',
    	'8' 	=> '添加联系人',
    	'9' 	=> '编辑联系人',
    	'10' 	=> '修改价格信息',
    	'11' 	=> '修改备注信息',
    	'12' 	=> '修改包装信息',
    	'13' 	=> '删除联系人',
    	'14' 	=> '联系人审核通过',
    	'15' 	=> '驳回并删除联系人',
    ),
	
	//指导价格浮动比例
    'FLAOT_RATIO' => array(
		'1'  => 1,
        '2'  => 0.8,
        '3'  => 0.6,
		'4'  => 0.5,
		'5'  => 0.4,
		'6'  => 0.3,
		'7'  => 0.1,
		'8'  => 0,
    ),
	
	//出售搜索底价
    'SEARCH_PRICE' => array(
		'1'  => array(1,20000,'2万以下'),
        '2'  => array(20000,50000,'2-5万'),
		'3'  => array(50000,100000,'5-10万'),
		'4'  => array(100000,200000,'10-20万'),
		'5'  => array(200000,500000,'20-50万'),
		'6'  => array(500000,1000000,'50-100万'),
		'7'  => array(1000000,10000000000000,'100万以上'),
		'8'  => array(0,0,'面议'),
    ),
	
	//商标字数
    'TM_NUMBER' => array(
        '1'  => '一个字母或中文',
        '2'  => '两个字母或中文',
		'3'  => '三个字母或中文',
		'4'  => '四个字母或中文',
		'5'  => '五个字母或中文',
		'6'  => '五个以上字母或中文',
    ),
	//商标标签
    'TM_LABEL' => array(
        '1'  => '精品',
		'2'  => '潜力',
		'3'  => '特色',
		'4'  => '紧急',
    ),

	//商标标签
    'SALE_TYPE' => array(
        '1'  => '出售',
        '2'  => '许可',
        '3'  => '出售/许可',
    ),


	'AUTH_LIST' => array(
		'1' => array(
			'label' => '商品列表',
			'child' => array(
				'1' => array(
					'label' => '国内商标列表',
				),
				// '2' => array(
				// 	'label' => '专利列表',
				// ),
				// '3' => array(
				// 	'label' => '国际商标列表',
				// ),
			),
		),
		'2' => array(
			'label' => '站点管理',
			'child' => array(
				'4' => array(
					'label' => '联系电话管理',
				),
				'5' => array(
					'label' => '黑名单列表',
				),
				'6' => array(
					'label' => '首页基本配置',
				),
				'7' => array(
					'label' => '首页模块设置',
				),
				'8' => array(
					'label' => '通栏行业菜单',
				),
			),
		),
		'3' => array(
			'label' => '系统配置',
			'child' => array(
				'12' => array(
					'label' => '账号管理',
				),
				'13' => array(
					'label' => '角色管理',
				),
			),
		),
		// '4' => array(
		// 	'label' => '任务管理',
		// 	'child' => array(
		// 		'14' => array(
		// 			'label' => '提醒列表',
		// 		),
		// 		// '15' => array(
		// 		// 	'label' => '临时求购',
		// 		// ),
		// 	),
		// ),
	),
	'ALL_AUTH' => array(
		'1' => array(
			'id'	=> '1',
			'up'	=> '1',
			'label' => '国内商标列表',
		),
		'2' => array(
			'id'	=> '2',
			'up'	=> '1',
			'label' => '专利列表',
		),
		'3' => array(
			'id'	=> '3',
			'up'	=> '1',
			'label' => '国际商标列表',
		),
		'4' => array(
			'id'	=> '4',
			'up'	=> '2',
			'label' => '联系电话管理',
		),
		'5' => array(
			'id'	=> '5',
			'up'	=> '2',
			'label' => '黑名单列表',
		),
		'6' => array(
			'id'	=> '6',
			'up'	=> '2',
			'label' => '首页基本配置',
		),
		'7' => array(
			'id'	=> '7',
			'up'	=> '2',
			'label' => '首页模块设置',
		),
		'8' => array(
			'id'	=> '8',
			'up'	=> '2',
			'label' => '通栏行业菜单',
		),
		'12' => array(
			'id'	=> '12',
			'up'	=> '3',
			'label' => '账号管理',
		),
		'13' => array(
			'id'	=> '13',
			'up'	=> '3',
			'label' => '角色管理',
		),
		// '14' => array(
		// 	'id'	=> '14',
		// 	'up'	=> '4',
		// 	'label' => '提醒列表',
		// ),
		// '15' => array(
		// 	'id'	=> '15',
		// 	'up'	=> '4',
		// 	'label' => '临时求购',
		// ),
	),
	'ROLE_LIST' => array(
		'role/index' 			=> '13',
		'role/add' 				=> '13',
		'role/edit' 			=> '13',
		'user/index' 			=> '12',
		'user/add' 				=> '12',
		'user/role' 			=> '12',
		'internal/index'		=> '1',
		'internal/create'		=> '1',
		'internal/edit'			=> '1',
		'internal/delete' 		=> '1',
		'internal/deleteSale' 	=> '1',
		'internal/doDown' 		=> '1',
		'internal/doUp' 		=> '1',
		//'patent/index'			=> '2',
		//'international/index' 	=> '3',
		'phone/index' 			=> '4',
		'blacklist/index' 		=> '5',
		// 'remind/index'			=> '14',
		// 'temp/index'			=> '15',
	),


	/*平台入驻*/
	'SALE_PLATFORM' => array(
		'1' 		=> array(
			'name'	=> '京东',
			'value'	=> '1,2,3,5,6,9,11,12,14,15,16,18,20,21,24,25,26,27,28,29,30,31,32,33,35,36,37,39,41,42,43,44,45',
						
		),
		'2' 		=> array(
			'name'	=> '天猫',
			'value'	=> '1,2,3,5,6,8,9,11,12,14,15,16,17,18,19,20,21,24,25,26,27,28,29,30,31,32,33,35,36,37,39,41,42,43,44,45',
			
		),
		'3' 		=> array(
			'name'	=> '亚马逊',
			'value'	=> '3,5,9,10,16,28,29,30,31,32,33,34,41,44',
		),
		'4' 		=> array(
			'name'	=> '1号店',
			'value'	=> '2,3,5,6,7,8,9,10,11,12,14,15,16,17,18,19,20,21,23,24,25,26,27,28,29,30,31,32,33,35,36,37,38,39,41,42,43,44',
		),
		'5' 		=> array(
			'name'	=> '美丽说',
			'value'	=> '18,24,25,26,29,30,31,32,33',
		),
		'6' 		=> array(
			'name'	=> '聚美优品',
			'value'	=> '3,5,8,9,10,11,14,15,16,18,21,24,25,26,28,29,30,31,32,33',
		),
		'7' 		=> array(
			'name'	=> '大型超市',
			'value'	=> '1,2,3,5,6,7,8,9,11,12,13,14,15,16,17,18,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34',
		),
	),

	'SecondStatus' => array (
		1     => '申请中',
		2     => '已注册',
		3     => '商标已无效',
		4     => '驳回中',
		5     => '驳回复审中',
		6     => '部分驳回',
		7     => '公告中',
		8     => '异议中',
		9     => '异议复审中',
		10    => '需续展',
		11    => '续展中',
		12    => '开具优先权证明中',
		13    => '开具注册证明中',
		14    => '撤销中',
		15    => '撤销复审中',
		16    => '撤回撤销中',
		17    => '变更中',
		18    => '变更代理人中',
		19    => '补证中',
		20    => '补变转续证中',
		21    => '转让中',
		22    => '更正中',
		23    => '许可备案中',
		24    => '许可备案变更中',
		25    => '删减商品中',
		26    => '冻结中',
		27    => '注销中',
		28    => '无效宣告中',
        ),
	

    'MSG_TEMPLATE' => array(
        'register'  => "%s（登录密码），系统已为您开通手机账户，登陆可查看求购进展，工作人员不会向你索要，请勿向任何人泄露。",
    ),
);


return $define;

?>