<?
/**
 +------------------------------------------------------------------------------
 * Spring框架 数据实体层
 +------------------------------------------------------------------------------
 * @mobile	13183857698
 * @qq		78252859
 * @author  void <lkf5_303@163.com>
 * @version 3.0
 +------------------------------------------------------------------------------
 */
class VisitlogSessionsApi extends Entity
{
	/**
	 * 数据表键[表的唯一标识]
	 */
	public $tableKey = 'visitlogSessions';

	/**
	 * 数据表主键
	 */
	public $pk       = 'id';
}
?>